// p88_2: calculate
#include <stdio.h>
#include <math.h>

int main(void)
{
    float amount[40];
    float sum = 0.0F;
    int i = 0;

    printf("~…—Ê (mm) ‚ğ“ü—Í (I—¹ => 999)\n");
    while (1)
    {
        printf("  %2d “ú–Ú => ", i + 1);
        scanf("%f", &amount[i]);

        if (amount[i] == 999)
        {
            break;
        }

        sum += amount[i];
        i++;
    }

    int n = i;
    printf("--------------------\n");
    printf("‡Œv: %.4f mm\n", sum);
    float average = sum / (float)n;
    printf("•½‹Ï: %.4f mm\n", average);

    sum = 0.0F;

    for (i = 0; i < n; i++)
    {
        sum += pow(amount[i] - average, 2.0);
    }

    double variance = sum / (float)n;
    double sd = sqrt(variance);

    printf("•ªU: %.4f\n", variance);
    printf("•Î·: %.4f\n", sd);

    return 0;
}

/*
“ü—Í:

    30.1
    31.4
    30.9
    30.7
    31.0
    30.3
    29.4
    29.6
    28.7
    26.8
    29.2
    26.6
    28.6
    29.2
    30.1
    30.3
    30.0
    30.6
    31.2
    31.4
    30.3
    30.3
    31.0
    31.0
    30.7
    30.4
    30.2
    30.5
    30.6
    30.7
    31.2


o—Í:

    ~…—Ê (mm) ‚ğ“ü—Í (I—¹ => 999)
       1 “ú–Ú => 30.1
       2 “ú–Ú => 31.4
       3 “ú–Ú => 30.9
       4 “ú–Ú => 30.71
       5 “ú–Ú => 31.0
       6 “ú–Ú => 30.3
       7 “ú–Ú => 29.4
       8 “ú–Ú => 29.6
       9 “ú–Ú => 28.7
      10 “ú–Ú => 26.8
      11 “ú–Ú => 29.2
      12 “ú–Ú => 26.6
      13 “ú–Ú => 28.6
      14 “ú–Ú => 29.2
      15 “ú–Ú => 30.1
      16 “ú–Ú => 30.3
      17 “ú–Ú => 30.0
      18 “ú–Ú => 30.6
      19 “ú–Ú => 31.2
      20 “ú–Ú => 31.4
      21 “ú–Ú => 30.3
      22 “ú–Ú => 30.3
      23 “ú–Ú => 31.0
      24 “ú–Ú => 31.0
      25 “ú–Ú => 30.7
      26 “ú–Ú => 30.4
      27 “ú–Ú => 30.2
      28 “ú–Ú => 30.5
      29 “ú–Ú => 30.6
      30 “ú–Ú => 30.7
      31 “ú–Ú => 31.2
      32 “ú–Ú => 999
    --------------------
    ‡Œv: 933.0001 mm
    •½‹Ï: 30.0968 mm
    •ªU: 1.3093
    •Î·: 1.1443
*/